mafeiGitHub/stm32Mp3/src/main.cpp
// main.cpp
//{{{  includes
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <stdint.h>
#include <math.h>

#include "memory.h"
#include "cmsis_os.h"

#include "lwip/netif.h"
#include "lwip/tcpip.h"
#include "lwip/dhcp.h"
#include "ipv4/lwip/ip_addr.h"
#include "lwip/api.h"
#include "os/ethernetif.h"

#ifdef STM32F746G_DISCO
  #include "stm32746g_discovery.h"
  #include "stm32746g_discovery_ts.h"
  #include "stm32746g_discovery_audio.h"
  #include "stm32746g_discovery_sd.h"
#else
  #include "stm32f769i_discovery.h"
  #include "stm32f769i_discovery_ts.h"
  #include "stm32f769i_discovery_audio.h"
  #include "stm32f769i_discovery_sd.h"
#endif

#include "../fatfs/fatFs.h"
#include "clcd.h"

#include "widgets/cRootContainer.h"
#include "widgets/cWidget.h"
#include "widgets/cListWidget.h"
#include "widgets/cValueBox.h"
#include "widgets/cWaveWidget.h"
#include "widgets/cWaveCentreWidget.h"
#include "widgets/cWaveLensWidget.h"
#include "cPowerWidget.h"

#include "decoders/cMp3decoder.h"

#include "../httpServer/httpServer.h"

#include "../libfaad/neaacdec.h"
#include "hls/cHls.h"
//}}}
//{{{  static vars
static osSemaphoreId mAudSem;
static bool mAudHalf = false;

static float mVolume = 0.5f;
static bool mVolumeChanged = false;

// mp3
static std::vector<std::string> mMp3Files;
static int fileIndex = 0;
static bool fileIndexChanged = false;

static int mPlayFrame = 0;
static int mLoadFrame = 0;

static int* mFrameOffsets = nullptr;
static uint8_t* mWave = nullptr;
static bool mWaveChanged = false;
static bool mWaveLoad = false;

// hls
static cHls* mHls;
static osSemaphoreId mHlsLoadedSem;

// ui
static cLcd* mLcd = nullptr;
static cRootContainer* mRoot = nullptr;
//}}}
//{{{  audio callbacks
//{{{
void BSP_AUDIO_OUT_HalfTransfer_CallBack() {
  mAudHalf = true;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//{{{
void BSP_AUDIO_OUT_TransferComplete_CallBack() {
  mAudHalf = false;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//}}}
static const bool kMaxTouch = 1;
static const bool kStaticIp = false;
//static const bool kStaticIp = true;
//mHls->getLoading() ? mHls->getInfoStr (mHls->mPlayFrame).c_str()
//mHls->getChunkInfoStr (0).c_str()
//mHls->getChunkInfoStr (1).c_str()
//mHls->getChunkInfoStr (2).c_str()
//mHls->getChanInfoStr().c_str()

//{{{
class cPowerWidget : public cWidget {
public:
  cPowerWidget (cHls* hls, uint16_t width, uint16_t height) : cWidget (COL_BLUE, width, height), mHls(hls) {}
  virtual ~cPowerWidget() {}

  virtual void render (iDraw* draw) {
    uint8_t* power = nullptr;
    int frame = mHls->mPlayFrame - mWidth/2;
    int frames = 0;
    for (auto x = 0; x < mWidth; x++, frame++) {
      if (frames <= 0)
        power = mHls->getPower (frame, frames);
      if (power) {
        uint8_t top = *power++;
        uint8_t ylen = *power++;
        draw->rectClipped (COL_BLUE, x, top, 1, ylen);
        frames--;
        }
      }
    }
private:
  cHls* mHls;
  };
//}}}
//{{{
static void aacLoadThread (void const* argument) {

  cLcd::debug ("aacLoadThread");

  mRoot->addBottomLeft (new cPowerWidget (mHls, mRoot->getWidth(), mRoot->getHeight()));
  mLcd->setShowDebug (false, true, false, true);  // debug - title, info, lcdStats, footer
  mHls->setBitrate (mHls->getMidBitrate());

  mHls->mTuneChan = 4;

  cHttp http;
  while (true) {
    if (mHls->getChan() != mHls->mTuneChan) {
      mHls->mPlayFrame = mHls->changeChan (&http, mHls->mTuneChan) - mHls->getFramesFromSec(19);
      mHls->setBitrate (mHls->getMidBitrate());
      }

    if (!mHls->load (&http, mHls->mPlayFrame))
      osDelay (1000);

    mHls->mRxBytes = http.getRxBytes();
    cLcd::debug ("aac loaded " + cLcd::dec (mHls->getChan()) + " "+ cLcd::dec (mHls->mRxBytes));
    osSemaphoreWait (mHlsLoadedSem, osWaitForever);
    }
  }
//}}}
//{{{
static void aacPlayThread (void const* argument) {

  cLcd::debug ("aacPlayThread");

  #ifdef STM32F746G_DISCO
    BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_HEADPHONE, int(mVolume * 100), 44100);
    BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_02);
  #else
    BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_SPEAKER, int(mVolume * 100), 44100);
    BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_13);
  #endif

  memset ((void*)AUDIO_BUFFER, 0, 8192);
  BSP_AUDIO_OUT_Play ((uint16_t*)AUDIO_BUFFER, 8192);

  int lastSeqNum = 0;
  while (true) {
    if (osSemaphoreWait (mAudSem, 50) == osOK) {
      int seqNum;
      int16_t* audioSamples = mHls->getAudioSamples (mHls->mPlayFrame, seqNum);
      if (mHls->mPlaying && audioSamples) {
        memcpy ((int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER + 4096), audioSamples, 4096);
        mHls->mPlayFrame++;
        }
      else
        memset ((int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER + 4096), 0, 4096);

      if (!seqNum || (seqNum != lastSeqNum)) {
        //mHls->setBitrateStrategy2 (seqNum != lastSeqNum+1);
        lastSeqNum = seqNum;
        osSemaphoreRelease (mHlsLoadedSem);
        }
      }
    }
  }
//}}}

//{{{
static void listDirectory (std::string directoryName, std::string indent) {

  cLcd::debug ("dir " + directoryName);

  cDirectory directory (directoryName);
  if (directory.getError()) {
    //{{{  open error
    cLcd::debug (COL_RED, "directory open error:"  + cLcd::dec (directory.getError()));
    return;
    }
    //}}}

  cFileInfo fileInfo;
  while ((directory.find (fileInfo) == FR_OK) && !fileInfo.getEmpty()) {
    if (fileInfo.getBack()) {
      //cLcd::debug (fileInfo.getName());
      }

    else if (fileInfo.isDirectory())
      listDirectory (directoryName + "/" + fileInfo.getName(), indent + "-");

    else if (fileInfo.matchExtension ("MP3")) {
      mMp3Files.push_back (directoryName + "/" + fileInfo.getName());
      cLcd::debug (indent + fileInfo.getName());
      cFile file (directoryName + "/" + fileInfo.getName(), FA_OPEN_EXISTING | FA_READ);
      //cLcd::debug ("- filesize " + cLcd::intStr (file.getSize()));
      }
    }
  }
//}}}
//{{{
static void uiThread (void const* argument) {

  mLcd->displayOn();
  cLcd::debug ("uiThread");
  //{{{  init vars
  bool button = false;
  int16_t x[kMaxTouch];
  int16_t y[kMaxTouch];
  uint8_t z[kMaxTouch];
  int pressed[kMaxTouch];
  for (auto touch = 0; touch < kMaxTouch; touch++)
    pressed[touch] = 0;
  //}}}

  // create widgets
  //mRoot->addTopLeft (new cListWidget (mMp3Files, fileIndex, fileIndexChanged, mRoot->getWidth(), mRoot->getHeight()-2*mRoot->getHeight()/5));
  //mRoot->addTopRight (new cValueBox (mVolume, mVolumeChanged, COL_YELLOW, cWidget::getBoxHeight()-1, mRoot->getHeight()));
  //mRoot->addBottomLeft (new cWaveLensWidget (mWave, mPlayFrame, mLoadFrame, mLoadFrame, mWaveChanged, mRoot->getWidth(), mRoot->getHeight()/5));
  //mRoot->addNextAbove (new cWaveCentreWidget (mWave, mPlayFrame, mLoadFrame, mLoadFrame, mWaveChanged, mRoot->getWidth(), mRoot->getHeight()/5));

  BSP_TS_Init (mRoot->getWidth(), mRoot->getHeight());
  while (true) {
    TS_StateTypeDef tsState;
    BSP_TS_GetState (&tsState);
    for (auto touch = 0; touch < kMaxTouch; touch++) {
      if (touch < tsState.touchDetected) { //) && tsState.touchWeight[touch]) {
        auto xinc = pressed[touch] ? tsState.touchX[touch] - x[touch] : 0;
        auto yinc = pressed[touch] ? tsState.touchY[touch] - y[touch] : 0;
        x[touch] = tsState.touchX[touch];
        y[touch] = tsState.touchY[touch];
        z[touch] = tsState.touchWeight[touch];
        if (!touch)
          button ? mLcd->press (pressed[0], x[0], y[0], z[0], xinc, yinc) : mRoot->press (pressed[0], x[0], y[0], z[0], xinc, yinc);
        pressed[touch]++;
        }
      else {
        x[touch] = 0;
        y[touch] = 0;
        z[touch] = 0;
        if (!touch && pressed[0])
          mRoot->release();
        pressed[touch] = 0;
        }
      }

    //{{{  button, leds
    button = BSP_PB_GetState(BUTTON_WAKEUP) == GPIO_PIN_SET;
    button ? BSP_LED_On (LED1) : BSP_LED_Off (LED1);
    #ifdef STM32F769I_DISCO
      tsState.touchDetected ? BSP_LED_On (LED2) : BSP_LED_Off (LED2);
      button ? BSP_LED_On (LED3) : BSP_LED_Off (LED3);
    #endif
    //}}}
    mLcd->startRender();
    button ? mLcd->clear (COL_BLACK) : mRoot->render (mLcd);
    if (tsState.touchDetected)
      mLcd->renderCursor (COL_MAGENTA, x[0], y[0], z[0] ? z[0] : cLcd::getHeight()/10);
    mLcd->endRender (button);

    if (mVolumeChanged) {
      //{{{  set volume
      BSP_AUDIO_OUT_SetVolume (int(mVolume * 100));
      mVolumeChanged = false;
      }
      //}}}
    }
  }
//}}}
//{{{
static void playThread (void const* argument) {

  cLcd::debug ("playThread");

